In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

csv_file = 'https://student-datasets-bucket.s3.ap-south-1.amazonaws.com/whitehat-ds-datasets/air-quality/AirQualityUCI.csv'
df = pd.read_csv(csv_file, sep=';')

df = df.drop(columns=['Unnamed: 15', 'Unnamed: 16'], axis=1)

df = df.dropna()
dt_series = pd.Series(data = [item.split("/")[2] + "-" + item.split("/")[1] + "-" + item.split("/")[0] for item in df['Date']], index=df.index) + ' ' + pd.Series(data=[str(item).replace(".", ":") for item in df['Time']], index=df.index)
dt_series = pd.to_datetime(dt_series)

df = df.drop(columns=['Date', 'Time'], axis=1)
df.insert(loc=0, column='DateTime', value=dt_series)

year_series = dt_series.dt.year
month_series = dt_series.dt.month
day_series = dt_series.dt.day
day_name_series = dt_series.dt.day_name()

df['Year'] = year_series
df['Month'] = month_series
df['Day'] = day_series
df['Day Name'] = day_name_series

df = df.sort_values(by='DateTime')

---

In [ ]:
df.head()

             DateTime CO(GT)  PT08.S1(CO)  ...  Month Day   Day Name
0 2004-03-10 18:00:00    2,6       1360.0  ...      3  10  Wednesday
1 2004-03-10 19:00:00      2       1292.0  ...      3  10  Wednesday
2 2004-03-10 20:00:00    2,2       1402.0  ...      3  10  Wednesday
3 2004-03-10 21:00:00    2,2       1376.0  ...      3  10  Wednesday
4 2004-03-10 22:00:00    1,6       1272.0  ...      3  10  Wednesday

[5 rows x 18 columns]

In [ ]:
def rep(ser):
  s1 = pd.Series(data = [float(str(i).replace(',','.'))for i in ser],index = df.index)
  return s1

rep(df['RH'])

0       48.9
1       47.7
2       54.0
3       60.0
4       59.6
        ...
9352    29.3
9353    23.7
9354    18.3
9355    13.5
9356    13.1
Length: 9357, dtype: float64

In [ ]:
l1 = ['CO(GT)', 'C6H6(GT)', 'T', 'RH','AH']
for i in l1:
  df[i] = rep(df[i])
print(df.head())

             DateTime  CO(GT)  PT08.S1(CO)  ...  Month  Day   Day Name
0 2004-03-10 18:00:00     2.6       1360.0  ...      3   10  Wednesday
1 2004-03-10 19:00:00     2.0       1292.0  ...      3   10  Wednesday
2 2004-03-10 20:00:00     2.2       1402.0  ...      3   10  Wednesday
3 2004-03-10 21:00:00     2.2       1376.0  ...      3   10  Wednesday
4 2004-03-10 22:00:00     1.6       1272.0  ...      3   10  Wednesday

[5 rows x 18 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9357 entries, 0 to 9356
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DateTime       9357 non-null   datetime64[ns]
 1   CO(GT)         9357 non-null   float64
 2   PT08.S1(CO)    9357 non-null   float64
 3   NMHC(GT)       9357 non-null   float64
 4   C6H6(GT)       9357 non-null   float64
 5   PT08.S2(NMHC)  9357 non-null   float64
 6   NOx(GT)        9357 non-null   float64
 7   PT08.S3(NOx)   9357 non-null   float64
 8   NO2(GT)        9357 non-null   float64
 9   PT08.S4(NO2)   9357 non-null   float64
 10  PT08.S5(O3)    9357 non-null   float64
 11  T              9357 non-null   float64
 12  RH             9357 non-null   float64
 13  AH             9357 non-null   float64
 14  Year           9357 non-null   int64
 15  Month          9357 non-null   int64
 16  Day            9357 non-null   int64
 17  Day Name       9357 non-null   object
dtypes: datetime64[ns](1), float64(13), int64(3), object(1)
memory usage: 1.4+ MB

In [ ]:
df.head(20)

              DateTime  CO(GT)  PT08.S1(CO)  ...  Month  Day   Day Name
0  2004-03-10 18:00:00     2.6       1360.0  ...      3   10  Wednesday
1  2004-03-10 19:00:00     2.0       1292.0  ...      3   10  Wednesday
2  2004-03-10 20:00:00     2.2       1402.0  ...      3   10  Wednesday
3  2004-03-10 21:00:00     2.2       1376.0  ...      3   10  Wednesday
4  2004-03-10 22:00:00     1.6       1272.0  ...      3   10  Wednesday
5  2004-03-10 23:00:00     1.2       1197.0  ...      3   10  Wednesday
6  2004-03-11 00:00:00     1.2       1185.0  ...      3   11   Thursday
7  2004-03-11 01:00:00     1.0       1136.0  ...      3   11   Thursday
8  2004-03-11 02:00:00     0.9       1094.0  ...      3   11   Thursday
9  2004-03-11 03:00:00     0.6       1010.0  ...      3   11   Thursday
10 2004-03-11 04:00:00  -200.0       1011.0  ...      3   11   Thursday
11 2004-03-11 05:00:00     0.7       1066.0  ...      3   11   Thursday
12 2004-03-11 06:00:00     0.7       1052.0  ...      3   11   Thursday
13 2004-03-11 07:00:00     1.1       1144.0  ...      3   11   Thursday
14 2004-03-11 08:00:00     2.0       1333.0  ...      3   11   Thursday
15 2004-03-11 09:00:00     2.2       1351.0  ...      3   11   Thursday
16 2004-03-11 10:00:00     1.7       1233.0  ...      3   11   Thursday
17 2004-03-11 11:00:00     1.5       1179.0  ...      3   11   Thursday
18 2004-03-11 12:00:00     1.6       1236.0  ...      3   11   Thursday
19 2004-03-11 13:00:00     1.9       1286.0  ...      3   11   Thursday

[20 rows x 18 columns]

In [ ]:
abc = df.describe()

In [ ]:
df.shape

(9357, 18)

In [ ]:
df.columns

Index(['DateTime', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'C6H6(GT)',
       'PT08.S2(NMHC)', 'NOx(GT)', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'PT08.S5(O3)', 'T', 'RH', 'AH', 'Year', 'Month', 'Day', 'Day Name'],
      dtype='object')

In [ ]:
# T2.1: How many rows contain -200 in each column except for the 'DateTime', 'Year', 'Month' and 'Day' columns?
a1 = [(i, df[df[i] == -200].shape[0]) for i in df.columns[1:-4]]
a1

[('CO(GT)', 1683),
 ('PT08.S1(CO)', 366),
 ('NMHC(GT)', 8443),
 ('C6H6(GT)', 366),
 ('PT08.S2(NMHC)', 366),
 ('NOx(GT)', 1639),
 ('PT08.S3(NOx)', 366),
 ('NO2(GT)', 1642),
 ('PT08.S4(NO2)', 366),
 ('PT08.S5(O3)', 366),
 ('T', 366),
 ('RH', 366),
 ('AH', 366)]

In [ ]:
a1p =  [(i, round(df[df[i] == -200].shape[0] * 100 / df.shape[0], 2 )) for i in df.columns[1:-4]]
a1p

[('CO(GT)', 17.99),
 ('PT08.S1(CO)', 3.91),
 ('NMHC(GT)', 90.23),
 ('C6H6(GT)', 3.91),
 ('PT08.S2(NMHC)', 3.91),
 ('NOx(GT)', 17.52),
 ('PT08.S3(NOx)', 3.91),
 ('NO2(GT)', 17.55),
 ('PT08.S4(NO2)', 3.91),
 ('PT08.S5(O3)', 3.91),
 ('T', 3.91),
 ('RH', 3.91),
 ('AH', 3.91)]

In [ ]:
df = df.drop(columns = ['CO(GT)', 'NMHC(GT)', 'NOx(GT)','NO2(GT)'], axis = 1)
df.columns

Index(['DateTime', 'PT08.S1(CO)', 'C6H6(GT)', 'PT08.S2(NMHC)', 'PT08.S3(NOx)',
       'PT08.S4(NO2)', 'PT08.S5(O3)', 'T', 'RH', 'AH', 'Year', 'Month', 'Day',
       'Day Name'],
      dtype='object')

In [ ]:
df.loc[df['Year'] == 2004, df.columns[1:-4]].describe()

       PT08.S1(CO)     C6H6(GT)  ...           RH           AH
count  7110.000000  7110.000000  ...  7110.000000  7110.000000
mean   1055.135443     3.876779  ...    40.292053    -5.310343
std     314.719517    37.859514  ...    46.983126    35.441047
min    -200.000000  -200.000000  ...  -200.000000  -200.000000
25%     919.000000     4.600000  ...    33.000000     0.855925
50%    1052.000000     8.600000  ...    47.700000     1.083550
75%    1221.000000    14.200000  ...    61.000000     1.404175
max    2040.000000    63.700000  ...    88.700000     2.231000

[8 rows x 9 columns]

In [ ]:
df.loc[df['Year'] == 2005, df.columns[1:-4]].describe()

       PT08.S1(CO)     C6H6(GT)  ...           RH           AH
count  2247.000000  2247.000000  ...  2247.000000  2247.000000
mean   1029.544726    -4.497864  ...    36.932888   -11.670190
std     373.059005    50.426047  ...    62.700754    48.186199
min    -200.000000  -200.000000  ...  -200.000000  -200.000000
25%     925.500000     2.900000  ...    37.200000     0.413350
50%    1055.000000     5.800000  ...    50.900000     0.596400
75%    1222.000000    11.200000  ...    64.750000     0.804950
max    1846.000000    43.000000  ...    86.600000     1.393000

[8 rows x 9 columns]

In [ ]:
df["Year"].value_counts()

2004    7110
2005    2247
Name: Year, dtype: int64

In [ ]:
df_2004 = df[df['Year'] == 2004]
df_2004.head()

             DateTime  PT08.S1(CO)  C6H6(GT)  ...  Month  Day   Day Name
0 2004-03-10 18:00:00       1360.0      11.9  ...      3   10  Wednesday
1 2004-03-10 19:00:00       1292.0       9.4  ...      3   10  Wednesday
2 2004-03-10 20:00:00       1402.0       9.0  ...      3   10  Wednesday
3 2004-03-10 21:00:00       1376.0       9.2  ...      3   10  Wednesday
4 2004-03-10 22:00:00       1272.0       6.5  ...      3   10  Wednesday

[5 rows x 14 columns]

In [ ]:
df_2004.shape

(7110, 14)

In [ ]:
df_2005 = df[df['Year'] == 2005]
df_2005.head()

                DateTime  PT08.S1(CO)  C6H6(GT)  ...  Month  Day  Day Name
7110 2005-01-01 00:00:00       1046.0       4.2  ...      1    1  Saturday
7111 2005-01-01 01:00:00       1275.0       8.8  ...      1    1  Saturday
7112 2005-01-01 02:00:00       1173.0       7.5  ...      1    1  Saturday
7113 2005-01-01 03:00:00       1163.0       7.6  ...      1    1  Saturday
7114 2005-01-01 04:00:00       1054.0       5.6  ...      1    1  Saturday

[5 rows x 14 columns]

In [ ]:
df_2005.shape

(2247, 14)

Now, let's replace the `-200` value with the median values for each column having indices between 1 and -4 (excluding -4) for both the 2004 and 2005 year DataFrames.

In [ ]:
for i in df_2004.columns[1:-4]:
  m_v = df_2004[i].median()
  df_2004[i] = df_2004[i].replace(to_replace = -200, value = m_v )

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [ ]:
for i in df_2005.columns[1:-4]:
  mv = df_2005[i].median()
  df_2005[i] = df_2005[i].replace(to_replace = -200, value = mv )

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [ ]:
a2 = [(i, df_2004[df_2004[i] == -200].shape[0]) for i in df.columns[1:-4]]
a2

[('PT08.S1(CO)', 0),
 ('C6H6(GT)', 0),
 ('PT08.S2(NMHC)', 0),
 ('PT08.S3(NOx)', 0),
 ('PT08.S4(NO2)', 0),
 ('PT08.S5(O3)', 0),
 ('T', 0),
 ('RH', 0),
 ('AH', 0)]

In [ ]:
perc = [(i, round(df_2004[df_2004[i] == -200].shape[0]*100/df.shape[0],2)) for i in df.columns[1:-4]]
perc

[('PT08.S1(CO)', 0.0),
 ('C6H6(GT)', 0.0),
 ('PT08.S2(NMHC)', 0.0),
 ('PT08.S3(NOx)', 0.0),
 ('PT08.S4(NO2)', 0.0),
 ('PT08.S5(O3)', 0.0),
 ('T', 0.0),
 ('RH', 0.0),
 ('AH', 0.0)]